avr-rust/avrd/packs/atmega/ATmega645P.atdf
        <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
          <bitfield caption="Prescaler Reset Timer/Counter2" mask="0x02" name="PSR2"/>
        </register>
        <register caption="Asynchronous Status Register" name="ASSR" offset="0xB6" size="1">
          <bitfield caption="Enable External Clock Interrupt" mask="0x10" name="EXCLK"/>
          <bitfield caption="AS2: Asynchronous Timer/Counter2" mask="0x08" name="AS2"/>
          <bitfield caption="TCN2UB: Timer/Counter2 Update Busy" mask="0x04" name="TCN2UB"/>
          <bitfield caption="Output Compare Register2 Update Busy" mask="0x02" name="OCR2UB"/>
          <bitfield caption="TCR2UB: Timer/Counter Control Register2 Update Busy" mask="0x01" name="TCR2UB"/>
        </register>
      </register-group>
      <value-group caption="" name="WAVEFORM_GEN_MODE">
        <value caption="Normal" name="VAL_0x00" value="0x00"/>
        <value caption="PWM, Phase Correct" name="VAL_0x02" value="0x02"/>
        <value caption="CTC" name="VAL_0x01" value="0x01"/>
        <value caption="Fast PWM" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="CLK_SEL_3BIT">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/32" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/64" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/128" name="VAL_0x05" value="0x05"/>
        <value caption="Running, CLK/256" name="VAL_0x06" value="0x06"/>
        <value caption="Running, CLK/1024" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 16-bit" name="TC16">
      <register-group caption="Timer/Counter, 16-bit" name="TC1">
        <register caption="Timer/Counter1 Control Register A" name="TCCR1A" offset="0x80" size="1">
          <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM1A"/>
          <bitfield caption="Compare Output Mode 1B, bits" mask="0x30" name="COM1B"/>
          <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM1"/>
        </register>
        <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x81" size="1">
          <bitfield caption="Input Capture 1 Noise Canceler" mask="0x80" name="ICNC1"/>
          <bitfield caption="Input Capture 1 Edge Select" mask="0x40" name="ICES1"/>
          <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM1" lsb="2"/>
          <bitfield caption="Prescaler source of Timer/Counter 1" mask="0x07" name="CS1" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter 1 Control Register C" name="TCCR1C" offset="0x82" size="1">
          <bitfield caption="Force Output Compare 1A" mask="0x80" name="FOC1A"/>
          <bitfield caption="Force Output Compare 1B" mask="0x40" name="FOC1B"/>
        </register>
        <register caption="Timer/Counter1  Bytes" name="TCNT1" offset="0x84" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register A  Bytes" name="OCR1A" offset="0x88" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register B  Bytes" name="OCR1B" offset="0x8A" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Input Capture Register  Bytes" name="ICR1" offset="0x86" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Interrupt Mask Register" name="TIMSK1" offset="0x6F" size="1">
          <bitfield caption="Timer/Counter1 Input Capture Interrupt Enable" mask="0x20" name="ICIE1"/>
          <bitfield caption="Timer/Counter1 Output Compare B Match Interrupt Enable" mask="0x04" name="OCIE1B"/>
          <bitfield caption="Timer/Counter1 Output Compare A Match Interrupt Enable" mask="0x02" name="OCIE1A"/>
          <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x01" name="TOIE1"/>
        </register>
        <register caption="Timer/Counter1 Interrupt Flag register" name="TIFR1" offset="0x36" size="1" ocd-rw="R">
          <bitfield caption="Input Capture Flag 1" mask="0x20" name="ICF1"/>
          <bitfield caption="Output Compare Flag 1B" mask="0x04" name="OCF1B"/>
          <bitfield caption="Output Compare Flag 1A" mask="0x02" name="OCF1A"/>
          <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x01" name="TOV1"/>
        </register>
      </register-group>
      <value-group caption="" name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
        <value caption="Running, ExtClk Tx Falling Edge" name="VAL_0x06" value="0x06"/>
        <value caption="Running, ExtClk Tx Rising Edge" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Watchdog Timer" name="WDT">
      <register-group caption="Watchdog Timer" name="WDT">
        <register caption="Watchdog Timer Control Register" name="WDTCR" offset="0x60" size="1">
          <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
          <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
          <bitfield caption="Watch Dog Timer Prescaler bits" mask="0x07" name="WDP" values="WDOG_TIMER_PRESCALE_3BITS"/>
        </register>
      </register-group>
      <value-group caption="" name="WDOG_TIMER_PRESCALE_3BITS">
        <value caption="Oscillator Cycles 16K" name="VAL_0x00" value="0x00"/>
        <value caption="Oscillator Cycles 32K" name="VAL_0x01" value="0x01"/>
        <value caption="Oscillator Cycles 64K" name="VAL_0x02" value="0x02"/>
        <value caption="Oscillator Cycles 128K" name="VAL_0x03" value="0x03"/>
        <value caption="Oscillator Cycles 256K" name="VAL_0x04" value="0x04"/>
        <value caption="Oscillator Cycles 512K" name="VAL_0x05" value="0x05"/>
        <value caption="Oscillator Cycles 1024K" name="VAL_0x06" value="0x06"/>
        <value caption="Oscillator Cycles 2048K" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Bootloader" name="BOOT_LOAD">
      <register-group caption="Bootloader" name="BOOT_LOAD">
        <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
          <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
          <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
          <bitfield caption="Read While Write section read enable" mask="0x10" name="RWWSRE"/>
          <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
      </register-group>
    </module>
    <module caption="USART" name="USART">
      <register-group caption="USART" name="USART0">
        <register caption="USART I/O Data Register" name="UDR0" offset="0xC6" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="USART Control and Status Register A" name="UCSR0A" offset="0xC0" size="1" ocd-rw="R">
          <bitfield caption="USART Receive Complete" mask="0x80" name="RXC0"/>
          <bitfield caption="USART Transmit Complete" mask="0x40" name="TXC0"/>
          <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE0"/>
          <bitfield caption="Framing Error" mask="0x10" name="FE0"/>
          <bitfield caption="Data OverRun" mask="0x08" name="DOR0"/>
          <bitfield caption="USART Parity Error" mask="0x04" name="UPE0"/>
          <bitfield caption="Double the USART Transmission Speed" mask="0x02" name="U2X0"/>
          <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM0"/>
        </register>
        <register caption="USART Control and Status Register B" name="UCSR0B" offset="0xC1" size="1">
          <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE0"/>
          <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE0"/>
          <bitfield caption="USART Data Register Empty Interrupt Enable" mask="0x20" name="UDRIE0"/>
          <bitfield caption="Receiver Enable" mask="0x10" name="RXEN0"/>
          <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN0"/>
          <bitfield caption="Character Size" mask="0x04" name="UCSZ02"/>
          <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB80"/>
          <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB80"/>
        </register>
        <register caption="USART Control and Status Register C" name="UCSR0C" offset="0xC2" size="1">
          <bitfield caption="USART Mode Select" mask="0x40" name="UMSEL0" values="COMM_USART_MODE"/>
          <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM0" values="COMM_UPM_PARITY_MODE"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS0" values="COMM_STOP_BIT_SEL"/>
          <bitfield caption="Character Size" mask="0x06" name="UCSZ0"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL0"/>
        </register>
        <register caption="USART Baud Rate Register  Bytes" name="UBRR0" offset="0xC4" size="2" mask="0x0FFF"/>
      </register-group>
      <value-group caption="" name="COMM_USART_MODE">
        <value caption="Asynchronous Operation" name="VAL_0x00" value="0x00"/>
        <value caption="Synchronous Operation" name="VAL_0x01" value="0x01"/>
      </value-group>
      <value-group caption="" name="COMM_UPM_PARITY_MODE">
        <value caption="Disabled" name="VAL_0x00" value="0x00"/>
        <value caption="Reserved" name="VAL_0x01" value="0x01"/>
        <value caption="Enabled, Even Parity" name="VAL_0x02" value="0x02"/>
        <value caption="Enabled, Odd Parity" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="COMM_STOP_BIT_SEL">
        <value caption="1-bit" name="VAL_0x00" value="0x00"/>
        <value caption="2-bit" name="VAL_0x01" value="0x01"/>
      </value-group>
    </module>
  </modules>
</avr-tools-device-file>
